{
  "server": [
    "NodeJS is a JavaScript runtime built to run smoothly as server architecture.  It’s use of non-blocking IO and event handling make it ideal for quickly creating scalable systems.  Many of the projects I have completed have been done either entirely using NodeJS or using NodeJS as the backend.  "
  ],
  "about": [
    "My name is Colin Fitzsimons, I'm a PhD student working with the department of Computer Science in Maynooth University.  My research focus there focuses on the use of immersive technologies in program construction.  A great interest of mine is leverage newly emerging technologies such as VR and AR to create a highly collaborative programming environment.  I've recently finished up an investigation into the cognitive effectiveness of current visual programming languages.  The aim is to use the lesions from this stage to design more cognitively effective notation.  The framework can also be used to carry out an evaluation of the system when it is designed.  The stage I am now moving onto deals with formally specifying how information interacts both spatially and temporally.  Mereotopology grants the ability to define both spatial and temporal mappings.  I believe that CSP can be used to specify how these mappings interact.  ",
    "Aside from my work as a PhD student I'm a passionate developer.  I love taking on interesting projects for companies.  I work fast and accurately and have been working as a freelance developer for a number of years.  I have been lead developer for a startup company called Ballzey for over a year where I've led implementation of the core Ballzey stack.  I've also worked with a number of other startups in a handful of industries (fitness, communication, language).  I focus primarily on prototyping systems in way that the infrastructure can be used in the future, even if the project is reengineered with different requirements.  My insistence on good and regular communication ensures that all parties are kept happy during the entire development process.  ",
    "If you're interested in looking at the work I've done and the technology I use, check out below.  If you have a project in mind that you think I could be a part of, feel free to contact me.  "
  ]
}
